# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'homebrew/bundle'

# Install ZSH
brew 'zsh'
brew 'zplug'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install more recent versions of some macOS tools
brew 'grep'

# Install Binaries
brew 'git'
brew 'hub'
brew 'tree'
brew 'mas'
brew 'trash'
brew 'wget'

# Apps
cask 'aerial'
cask 'alfred'
cask 'bartender'
cask 'dash'
cask 'discord'
cask 'firefox'
cask 'google-chrome'
cask 'intellij-idea-ce'
cask 'iterm2'
cask 'java8'
cask 'karabiner-elements'
cask 'postman'
cask 'rocket'
cask 'slack'
cask 'vlc'
cask 'visual-studio-code'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
