# Taps
tap 'homebrew/cask-cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/bundle'

# Install ZSH
brew 'zsh'
brew 'zplug'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install more recent versions of some macOS tools
brew 'grep'

# Install Binaries
brew 'git'
brew 'hub'
brew 'tree'
brew 'mas'
brew 'trash'
brew 'wget'

# Apps
cask 'alfred'
cask 'bartender'
cask 'dash'
cask 'firefox'
cask 'iterm2'
cask 'karabiner-elements'
cask 'slack'
cask 'visual-studio-code'
cask 'amphetamine'

# Fonts
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
