# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'homebrew/bundle'
tap 'homebrew/dupes'

# Install ZSH
brew 'zsh'
brew 'zplug'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'

# Install more recent versions of some macOS tools
brew 'homebrew/dupes/grep'

# Install Binaries
brew 'git'
brew 'hub'
brew 'tree'
brew 'mas'
brew 'rbenv'
brew 'trash'
brew 'wget'

# Development
brew 'mysql'
brew 'postgresql'

# Apps
cask 'aerial'
cask 'firefox'
cask 'google-chrome'
cask 'gpgtools'
cask 'intellij-idea-ce'
cask 'iterm2'
cask 'java'
cask 'postman'
cask 'sequel-pro'
cask 'slack'
cask 'vlc'
cask 'visual-studio-code'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Install Mac App Store apps
mas 'DaisyDisk', id: 411643860
mas 'iA Writer', id: 775737590
mas 'Polymail', id: 1134717305
mas 'Textual 6', id: 896450579
